Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/ingest/approval.po
Languages: sv

source: Approval
sv: Godkännande

source: Before an AIP can be preserved it has to be approved.
sv: Innan ett IP kan arkiveras så måste det godkännas.

source: When clicking on an AIP in the Approval list we see a request form for applying actions on an AIP. There are a couple of different types of request which are explained below
sv: När man klickar på ett IP i listan får man fram ett formulär där man kan välja att utföra eventuella årgärder på en AIP. Dessa åtgärder beskrivs nedan.

source: Preserve
sv: Arkivera

source: Preserve AIP to archival storage according to information from profiles.
sv: Arkivera AIP till archival storage enligt information från profiler.

source: Choose **Preserve**, and click **Submit** to start the preservation process. The progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj **Arkivera**, fyll i önskad information och klicka på **Skicka**. Händelseförloppet kan följas i status-fältet för IP:t.Se :ref:`Tillståndsvy <user-interface-state-view>` för mer information.

source: Get
sv: Hämta

source: Get AIP to Ingest Workspace as `read only`. This means that the IP in the workspace can not be changed, only "read".
sv: Hämtar en AIP som `read only` vilket betyder att den inte kan ändras. IP:t kommer då att dyka upp under mottagande/arbetsyta

source: Choose **Get**, and click **Submit**. The AIP will appear in the workspace shortly. The progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj alternativet **Hämta** Fyll i önskad information och klicka på **Skicka**. Händelseförloppet kan följas i status-fältet för IP:t. Se :ref:`Tillståndsvy <user-interface-state-view>` för mer information.

source: Get as new generation
sv: Hämta som ny generation

source: Get IP to Ingest Workspace as a new generation of IP. The new IP is basically a whole new IP but it is still related to the family of IPs that are related to the same AIC.
sv: Hämta IP till mottagande/arbetsyta som en ny generation. Den nya generationen är i princip ett helt eget IP men är relaterad till sina tidigare och senare generationer genom dess AIC.

source: Choose the option **Get as new generation**, and click **Submit**. The AIP generation should appear in the ingest workspace shortly, the progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj alternativet **Hämta som ny generation** Fyll i önskad information och klicka på **Skicka**. Händelseförloppet kan följas i status-fältet för IP:t Se :ref:`Tillståndsvy <user-interface-state-view>` för mer information.
