Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/ingest/reception.po
Languages: sv

source: Receive SIP
sv: Ta emot SIP

source: To receive an IP, first select one IP by clicking on it in the list. To select multiple IPs, either hold the :kbd:`CTRL` key and click each IP or click the first IP, hold the :kbd:`SHIFT` key and click another to select all IPs between including the two selected.
sv: För att ta emot ett IP väljer man ett eller flera paket i listan. Ett IP kan väljas genom att klicka på dess rad i listan. Flera kan väljas antingen genom att hålla nere :kbd:`CTRL` och välja alla paket ett i taget eller genom att välja ett, hålla in :kbd:`SHIFT` och välja ett annat, så markeras alla paket mellan dessa inklusive de två valda.

source: To select all visible IPs use the **Select all** option.
sv: För att välja alla synliga informationspaket använd **Markera alla** alternativet.

source: When the desired IPs are selected, click the **Receive**-button in the bottom right corner.
sv: När samtliga paket har valts klicka på knappen **Ta emot** längst ner i högra hörnet.

source: Clicking the **Receive**-button will open a window to receive the first included IP.
sv: När knappen väl klickats kommer ett nytt fönster att öppnas för att ta emot det första valda IP:t.

source: Profile Editor
sv: Profilredigerare

source: Use the dropdown to select which submission agreement to use, then click **Prepare**. If the dropdown is disabled, the IP already has a related submission agreement.
sv: Använd rullistan för att välja vilken leveransöverenskommelse som ska användas, klicka sedan på **Förbered**. Om rullistan är inaktiverad har IPt redan en koppling till leveransöverenskommelsen.

source: The profile editor is where the user can edit data of a profile for a specific IP. The submission agreement's data fields can be viewed by clicking the **view** button next to the dropdown.
sv: I profilredigeraren kan en användare redigera data i en profil för ett specifikt IP. Datafälten för en leveransöverenskommelse kan läsas genom att klicka på **Visa**-knappen bredvid rullistan.

source: Underneath the submission agreement row, all related profiles are listed. Click **edit** next to a profile to edit the data of the profile for the IP to be received. When satisfied with the edit, click **Save**.
sv: Under leveransöverenskommelse finns alla relaterade profiler listade. Klicka på **Redigera** för att redigera profildata för paketet som ska tas emot. Klicka sedan **Spara**

source: When saving profile data, the previous versions are still available in the version dropdown. Choose between data versions and click save to apply.
sv: När man sparar profildata så finns alla tidigare versioner att välja i version-rullistan. Välj mellan versioner och klicka **Spara** för att spara.

source: This can be done on each profile type, remember to save the data before closing the profile form.
sv: Detta kan göras på alla profiltyper. Kom ihåg att spara datat så det inte går förlorat.

source: To receive an IP it needs to be placed in an archive and a structure so that the IP and its content is indexed and can be found on the search page. First select archive, then structure and last structure unit, which is where we will find the IP in the search result tree structure.
sv: För att ta emot ett IP behöver det bli placerat i ett arkiv och en struktur så att paketet och dess innehåll blir indexerat och kan hittas på söksidan. Välj först arkiv, sedan struktur och sist strukturenhet. Strukturenheten är där vi kommer hitta paketet i arkivets hierarkiska struktur.

source: When satisfied with the submission agreement and the profiles, select an **Archive policy** and click **Receive**. The process of receiving the IP is started and if more IPs are included a window for the next IP will appear. An IP can be skipped by clicking the **Skip**-button.
sv: När användaren är nöjd med leveransöverenskommelse och profiler väljs en **Arkivpolicy** och man klickar på **Ta emot**. Därefter startas mottagande-processe och om flera paket valts öppnas en ny ruta med nästa IP. Det går att hoppa över ett IP genom att klicka på **Hoppa över**.

source: When an IP is received it is no longer visible in the reception list and can be found in the :ref:`Approval <approval>` section
sv: När ett IP har tagits emot lists det inte längre i receptionen, det ligger istället under :ref:`Godkännande <approval>`.
