Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/agents/locale/*/LC_MESSAGES/django.po
Languages: sv

source: Agents
sv: Agenter

source: name
sv: namn

source: mirrored type
sv: motsatt typ

source: agent relation type
sv: Agentrelationstyp

source: agent relation types
sv: Agentrelationstyper

source: description
sv: beskrivning

source: start date
sv: startdatum

source: end date
sv: slutdatum

source: create date
sv: skapandedatum

source: full
sv: fullständig

source: partial
sv: partiell

source: draft
sv: utkast

source: final
sv: slutgiltig

source: language
sv: språk

source: type
sv: typ

source: Relation between "{}" and "{}"
sv: Relation mellan "{}" och "{}"

source: Agent node relation
sv: Agentnodrelation

source: Agent node relations
sv: Agentnodrelationer

source: agent tag relation type
sv: agentnodrelationstyp

source: agent tag relation types
sv: agentnodrelationstyper

source: agent note type
sv: agentanmärkningstyp

source: agent note types
sv: agentanmärkningstyper

source: authority type
sv: auktoritetstyp

source: authority types
sv: auktoritetstyper

source: identifier
sv: identifierare

source: agent identifier type
sv: agentidentifieringstyp

source: agent identifier types
sv: agentidentifieringstyper

source: alternative name
sv: alternativt namn

source: reference code
sv: referenskod

source: start year
sv: startår

source: end year
sv: slutår

source: longitude
sv: longitud

source: latitude
sv: latitud

source: agent place type
sv: agentplaceringstyp

source: agent place types
sv: agentplaceringstyper

source: corporate body
sv: företag

source: family
sv: familj

source: main type
sv: huvudtyp

source: agent type
sv: Agenttyp

source: agent types
sv: Agenttyper

source: main agent type
sv: huvudagenttyp

source: main agent types
sv: huvudagenttyper

source: authority
sv: auktoritet

source: agent name type
sv: agentnamntyp

source: agent name types
sv: agentnamntyper

source: country code
sv: landskod

source: repository code
sv: depåkod

source: Relation to self cannot be created
sv: Relation till sig själv kan inte skapas

source: Same relation cannot be created twice
sv: Samma relation kan inte skapas flera gånger

source: Agents requires at least one name
sv: Agenter kräver minst ett namn
