Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/administration/storage-migration/index.po
Languages: sv

source: Storage migration
sv: Lagringsmigrering

source: Storage migration basically means moving data from one storage target to another.
sv: Lagringsmigrering innebär i princip att flytta data från ett lagringsmedia till annan.

source: Select storage mediums
sv: Välj lagringsmedier

source: When migrating information packages we start by selecting storage mediums that contains the information packages. When a storage medium is visible in the storage medium table it means that it has information packages that has a storage target with status "Migrate" and the storage method has a storage target with status "Enabled" that does not yet have given.
sv: Vid migrerar av informationspaket börjar man att välja lagringsmedier som innehåller informationspaketen. När ett lagringsmedium är synligt i listan för lagringsmedier betyder det att den har informationspaket som har en lagringsmetod med en "target" med status "Migrate" och en annan "target" med status "Enabled" som då ännu inte har någon lagringspost.

source: The storage medium list has two filtering options, storage policy and medium ID (single or range). Mediums can be filtered by storage policy which is initially set to the first storage policy. The storage policy filter is required and will always have a value to ble able to populate the storage medium list. The medium ID filter has two different variations. The first option is to search and select on single storage medium which filters out selected medium. The second is for filtering out a range of mediums. The medium ID range filter can be activated by checking the checkbox labeled **Enter medium ID range**. This checkbox also disables the single medium ID option and clears it's value. The range filter allows a user to select the first and last medium ID by searching and selecting medium IDs. When unchecking the checkbox the range filter is disabled and its values are cleared in favor of single medium ID filtering.
sv: Listan med lagringsmedier har två filtreringsalternativ, lagringspolicy och medium ID (enkelt eller intervall). Medier kan filtreras efter lagringspolicy som initialt är inställd på den första lagringspolicyn. Lagringspolicyn filter krävs och kommer alltid att ha ett värde för att kunna fylla i lagringsmedielistan. Media-ID-filtret har två olika alternativ. Det första alternativet är att söka och välja på en enda lagring medium. Det andra är för att filtrera medium inom ett från och till intervall av medier. Filtret för medium ID-intervall kan aktiveras av markera kryssrutan märkt **Ange spann för medium ID**. Den här kryssrutan inaktiverar också alternativet för enstaka medium-ID och rensar dess värde. Intervallfilter tillåter en användare att välja första och sista medium-ID med söka och välja medium-ID. När du avmarkerar kryssrutan visas intervallfiltret är inaktiverat och dess värden rensas till förmån för singel medium ID-filtrering.

source: Select Information packages
sv: Nu kan man välja att påbörja migreringen direkt av valda medier eller välja ut enskilda informationspaket för migrering

source: Multiple storage mediums can be selected by clicking the corresponding rows in the storage medium table. When at least one storage medium is selected the information package list is visible which is where we select which information packages we want to migrate. The information packe list is filtered by selected mediums in the storage medium list, which means that if multiple mediums are selected, IP's stored on one of the selected mediums will be visible.
sv: Flera lagringsmedier kan väljas genom att klicka på motsvaranderader i listan med lagringsmedier. När minst ett lagringsmedium är valt går det att starta migreringen av media alternativt välja enskilda informationspaket för migrering. Informationspaket listan filtreras efter valda medier i listan med lagringsmedier, som betyder att om flera medier väljs presenteras en aggregerad lista av informationspaket för utvalda medier.

source: The IP list works in the same way as other IP list views in ESSArch and we can view the job and event list as well as the filebrowser and the main "Migrate" tab which is where we proceed with the migration process after selecting IPs for migration (choose multiple by holding the alt/shift key and clicking as usual). When IPs are selected click the **Start migration** button.
sv: IP-listan fungerar på samma sätt som andra IP-listvyer i ESSArch och vi kan se jobb- och händelselistan samt innehåll och huvudfliken "Migrera" som är där vi fortsätter med migreringsprocessen efter att ha valt IP för migrering (välj flera genom att hålla ned ctrl-tangenten och klicka som vanligt). När IP är valda klickar du på knappen **Starta migrering**.

source: Storage migration options
sv: Alternativ för lagringsmigrering

source: In the storage migration modal window we get a list of selected information packages along with options for the migration job.
sv: I modalfönstret för lagringsmigrering får vi en lista över valdainformationspaket tillsammans med alternativ för migreringsjobbet.

source: **Temporary path** is where the content we are migrating will be stored during the data move, it is prepopulated with configured temp path.
sv: **Temporär sökväg** är där innehållet vi migrerar kommer att mellanlagras under migreringen och den är förifylld med konfigurerad temp-sökväg. Det går även att välja om man önskar att exportera extra kopia genom att klicka i "Exportera kopia" följt av att man anger en sökväg för exporten.

source: **Purpose** is a text field that will be used as comment for the storage migration event.
sv: **Syfte** är ett textfält som kommer att användas som kommentar för lagringenmigreringshändelsen.

source: **Migrate to all storage targets** is checked by default which means that the migration job will migrate to all storage methods for each selected IP. Unchecking this option enables a select box which allows multiple choices and search where storage methods can be manually selected for migration.
sv: **Migrera till lagringsmetoder** är markerat som standard vilket betyder att migreringsjobbet kommer att migrera till alla lagringsmetoder för varje vald IP eller media. Om du avmarkerar det här alternativet kommer ingen skrivning till nytt media att ske, vilket är användbart om endast en export kopia skall framställas.

source: Preview storage migration
sv: Förhandsgranska lagringsmigrering

source: When all options for storage migrations looks OK we can preview the migration to see information packages that will be migrated along with storage targets for each IP. Clicking an IP row will expand it and show which storage targets it will be migrated to.
sv: När alla alternativ för lagringsmigrering ser OK ut kan vi förhandsgranska migrering för att se informationspaket som kommer att migreras tillsammans med lagringsmål för varje IP. Klicka på en IP-rad för att expandera och visa vilka lagringsmål den kommer att migreras till eller exporteras.

source: Start storage migration
sv: Starta lagringsmigrering

source: It the preview looks good, then we are ready to start the migration job by first closing the preview window then clicking the **Start migration** button.
sv: Om förhandsgranskningen ser bra ut är vi redo att påbörja migreringsjobbet genom att först stänga förhandsgranskningsfönstret och sedan klicka på **Starta migrering** knappen.

source: All migration jobs can be found under the **Migration tasks** tab. Click a migration job row to see the task information modal.
sv: Alla migreringsjobb finns under fliken **Migreringsjobb**. Klicka på en migreringsjobbrad för att se detaljer.
