Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/access/storage-units.po
Languages: sv

source: Storage units
sv: Förvaringsenheter

source: Access/storage-units is where all **preserved** AIPs are listed. We can see information such as events and steps/tasks of the preserved AIP.
sv: Åtkomst/förvaringsenheter innehåller alla **arkiverade** AIPer. Vi kan även se information som händelser och jobb som resterande vyer.

source: When clicking a row in the Access list view the user can make request from a request form. The available requests in Access are explained below.
sv: När man klickar ett IP i denna vy så får man se ett request-formulär. Tillgängliga request förklaras nedan.

source: Get
sv: Hämta

source: Access AIP in archival storage to the Workspace with content extracted as read only.
sv: Hämta AIP i extraherad form som read_only till Åtkomst/arbetsyta.

source: Choose the option **Get** and click **Get**. The AIP generation should appear in the Access workspace shortly, the progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj alternativet **Hämta** Fyll i önskad information, markera **Förfrågan godkänd** och klicka på **Skicka**. Händelseförloppet kan följas i status-fältet för paketet eller i större detalj i :ref:`Tillståndsvyn <user-interface-state-view>` för mer information.

source: Get as container
sv: Hämta som container

source: Access AIP in archival storage to the Workspace as a tar or zip file.
sv: Hämta AIP som tar eller zip-fil till Åtkomst/arbetsyta

source: Choose the option **Get as container** and click **Get**. The AIP generation should appear in the workspace shortly, the progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj alternativet **Hämta som container** och klicka på **Skicka**. Progressen kan följas i status-fältet för paketet eller i större detalj i :ref:`Tillståndsvyn <user-interface-state-view>` för mer information.

source: Get as new generation
sv: Hämta som ny generation

source: Access AIP in archival storage to the Workspace as a new generation of the AIP. The new IP is basically a whole new IP but it is still related to the family of IPs that are related to the same AIC.
sv: Hämta ip till Åtkomst/arbetsyta som en ny generation. Den nya generationen är i princip ett helt eget IP, den är bara relaterad till sina tidigare och senare generationen genom samma AIC.

source: Choose the option **Get as new generation** and click **Get**. The AIP generation should appear in the Access workspace shortly, the progress can be followed in the status bar of the IP and in the :ref:`State view <state-view>` for more detailed information.
sv: Välj alternativet **Hämta som ny generation** Fyll i önskad information, markera **Förfrågan godkänd** och klicka på **Hämta**. Progressen kan följas i status-fältet för paketet eller i större detalj i :ref:`Tillståndsvyn <user-interface-state-view>` för mer information.
