Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/producer/prepare-ip.po
Languages: sv

source: Prepare IP
sv: Förbered IP

source: The first step in the process of SIP creation is Prepare IP, IPs That are not yet **Prepared** are listed in the Prepare IP list view.
sv: Det första steget i SIP-skapandet är Förbered IP.IPn som ännu inte är **Prepared** listas i listvyn.

source: Prepare
sv: Förbered

source: The prepare process is started by clicking the **Prepare IP** button.
sv: Första steget är att klicka på **Förbered IP**

source: The user is then asked to type a label for the new IP and can optionally enter a custom identifier value.
sv: Användaren skriver en etikett för IPt och kan även ange en egen identifierare.

source: Profile editor
sv: Profileditor

source: When clicking the IP row in the list view, the user can chose which Submission Agreement(SA)-profile to use. The Submission Agreement fields can be viewed by clicking the **View** button next to the SA-select. When the user is satisfied, he/she locks it by clicking the lock button.
sv: När ett IP i listvyn klickas, kan användaren välja vilken leveransöverenskommelse som ska användas för IPt. Man kan även se fält i leveransöverenskommelsen kenom att klicka på **Visa**-knappen bredvid rullistan. När användaren är nöjd med sitt val klickar denne på låsknappen

source: After Submission agreement is locked, the profiles can be viewed and edited.
sv: När en leveransöverenskommelse är låst kan man se och redigera dess profiler

source: The user can edit profiles by clicking the **Edit** button in the profile table which will allow the user to edit the data of the profile fields for that specific profile. When done, click **save** and a new version of the profile data will be saved and made the current version.
sv: En användare kan redigera profiler genom att klicka på **Redigera**-knappen.Användaren kan redigera data för profil-fälten för varje specifik profil.När profilerna är färdiga klicka på **Spara** och en ny version av profil-datan sparas som den nuvarande versionen

source: The user can use the **Versions**-dropdown list to choose earlier or later versions of the profile data.
sv: **Version**-rullistan kan användas för att välja en tidigare eller senare version av profil-data.

source: If the user is satisfied with all profiles, the IP can be prepared by clicking the **Prepare**-button in the bottom right corner.
sv: När användaren är nöjd med profilerna kan IPt förberedas genom att klicka på **Förbered**-knappen nere i det högra hörnet.

source: When IP is Prepared it is no longer visible in the Prepare IP list view and can be found in the Collect content list view.
sv: När ett IP är förberett kan det hittas i listvyn i **Samla innehåll**.
