Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/maintenance/maintenance-appraisal.po
Languages: sv

source: Appraisal
sv: Gallring

source: The main function of the appraisal page is creating appraisal rules that run jubs automatically or manually on selected content in the archive.
sv: Under gallringssidan skapar vi gallringsregler som körs automatiskt eller manuellt på utvalt arkiverat material.

source: Create appraisal rule
sv: Skapa gallringsregel

source: To create a new appraisal rule click **Create** aprpaisal rule list.
sv: För att skapa en ny regel klickar vi på *Skapa* ovanför listan med regler.

source: Enter a name for the new appraisal rule, when it should be run and selected target files.
sv: Fyll i ett namn för den nya gallringsregeln, hur ofta den ska köras och vilka filer som ska gallras i alla kopplade AIP:er.

source: **Frequency** decides how often a rule should be executed and is specified with **cron** syntax. For example: ``0 15 * * 3`` means every wednesday at 15 o' clock.
sv: **Frekvens** är vad som bestämmer hur ofta en regel ska exekveras och specificeras med en **cron**-syntax. T.ex. ``0 15 * * 3`` för varje onsdag klockan 15.

source: Connect rule to AIP
sv: Koppla regel till AIP

source: Enter the **Access/Storage units** page, mark one or more AIP(s), right click one of them and select **Appraisal** and a list of the selected AIPs appears. Every row can be expanded to see connected appraisal rules for the specific AIP. We also get a button for adding new rules to AIPs.
sv: Om vi går till **Åtkomst/Förvaringsenheter**, markerar en eller flera AIP:er, högerklickar och väljer **Gallring** så får vi upp en lista med AIP:erna vi valt som vi då kan expandera för att se kopplade regler. Vi får även upp en knapp för att lägga till nya regler.

source: Appraisal job lists
sv: Jobblistor

source: Under the list of appraisal rules there are three more list views containing appraisal jobs filtered by states **Ongoing**, **Next** and **Finished**. The **Ongoing** list shows jobs that are currently running, the **Next** list shows jobs that will be run automatically in execution order and the **Finished** list shows jobs that are finished.
sv: Under listan med regler så har vi tre listor med gallringsjobb som är filtrerade utefter status på jobben. **Pågående** visar gallringsjobb som körs just nu, **Nästa** är jobb som kommer att exekveras och **Avslutade** är jobb som är klara.

source: In the **Next** list the appraisal job can be previewed by clicking the **Preview** button.
sv: I **Nästa**-listan går det att förhandsgranska jobb genom att klicka på **Förhandsgranska**.

source: When a rule is connected to at least on AIP, jobs will be created and visible in the **next** list. The job will be executed at the given **start** time, except if the user wants to start the job before the given time. A job in the **Next** list can be started manually by clicking **Preview** and then **Run**. The job will then be moved to the **Ongoing** list and finally to the **Finished** list.
sv: När en regel är kopplad till minst en AIP så kommer det skapas ett jobb under **Nästa**. Det jobbet kan vi antingen vänta på ska exekveras automatiskt vid tiden som står under **Start**. Alternativt kan vi klicka på **Förhandsgranska** och sedan **Kör** för att exekvera på en gång. Jobbet kommer då flyttas till **Pågående** och sist **Avslutade**.

source: In the **Finished** a user can see the appraisal report for the finished job by clicking **report**.
sv: När jobbet är klart och är under **Avslutade** så kan vi klicka på **Rapport** för att se rapporten för det jobbet.
