Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/archival-description-management/accessions.po
Languages: sv

source: Accession Records
sv: Leveransliggare/Accessionshantering

source: Accession records store information about the receipt of materials to the archive. Accession records tell you what material that was received, who it was received from, when it was received, and what resource(s)/collection(s) the material will be dispersed into. ESSArchs accession management is designed to be used with different levels of complexity when describing accessions ranging from a simple logging of events to transfer management with linking to resource(s)/collection(s).
sv: Accessionsposter lagrar information om mottagandet av material till arkivet och dokumenterar vilke material som tagits emot, från vem det togs emot ifrån och när. ESSarchs leverans- och accessionshantering är designad för att kunna användas på olika sätt och med olika komplexitet från en enkel loggning av händelser till hantering av fler överföringar inom samma leverans med länkningt till det levererade materialet.

source: Adding new accession records
sv: Lägg till en ny accession/leverans

source: Accession records are located under the accession tab in ESSArchs archival description section.
sv: Leveranshanteringen nås genom att klicka på "Leveransfilken" i ESSArcs arkivredovisningssektion.

source: Accessions overview
sv: Leveransöversikt

source: Basic accession information
sv: Grundläggande information om leveransen

source: The Basic Information section of an ESSArch accession record helps archivists document the new acquisitions and also record key details about the nature and scope of materials. ESSArch will automatically generate a numeric identifier when a new accession is created; it is an automatic increment of 1. This identifier, which is the Accession ID, is used to track accessions and is also employed in preservation workflows.
sv: Den grundläggande informationen om en leverans är till för att dokumentera vissa nyckel värden om leveransen så som innehållet av leveransen. ESSArch skapar automatiskt ett numeriskt accessionsnummer för leveransen som inkrementeras med 1 för varje ny leverans.

source: Accession basic information modal
sv: Leveransfomulär med grundläggande information

source: Field
sv: Fält

source: Description
sv: Beskrivning

source: Name
sv: Namn

source: The name of the accession
sv: Leveransens namn/titel

source: Acquisition Type
sv: Typ av leverans

source: A general term for the means by which Archives came to have custody of the accessioned materials.
sv: Beskriver på vilket sätt arkivet har fått arkivet i sin vård. t.ex. genom en gåva eller deposition.

source: A description of the materials contained within the accession. Can include information about physical condition, inventory, disposition and provenance etc.
sv: En beskrivning av materialet som levereras. Kan inkludera information om fysiskt skick, inventarielistor m.m.

source: Producer organization
sv: Arkivbildare

source: Links to an authority record that is responsible in some way for the accession's creation or custody transfer to the archive.
sv: Kopplar en auktoritetspost(arkivbildare) som på något sätt har med leveransen att göra. Antingen som arkivbildare eller som ansvarig för överföringen till arkivet.

source: Submission agreement
sv: Leveransöverenskommelse

source: Link to a specific submission agreement that regulates the custody transfer to the archive
sv: Koppling till en specifik leveransöverenskommelse som reglerar överföringen till arkivet

source: Reference code
sv: Referenskod

source: Can be used for external reference or as a custom accession number
sv: Referens till externt id t.ex. ett diarenummer

source: Accession Events
sv: Leveranshändelser

source: Adding events
sv: Lägg till händelser

source: By clicking the add button new events can be appended to the accession record
sv: Klicka på "Lägg till knappen" för att lägga till nya händelser i leveransen

source: Create Accession events
sv: Skapa Leveranshändelser

source: Event Types
sv: Händelsetyper

source: The following event types is available from a standard installation of ESSArch. Event types can be edited and new types can be added through ESSArchs administration interface.
sv: Följande händelsetyper finns tillgängliga i standardinstallationen av ESSarch Händelsetyperna namn är på engelska för att följa internationellt vedertagna vokabluär men det är möjligt att redigera eller lägga till nya typer genom ESSArchs adminstrationsgränssnitt.

source: Event
sv: Händelse

source: Event Code
sv: Händelsekod

source: Be careful when updating Event types! Some event types have dependecies to preservation workflows that might break if event codes are changed.
sv: Var försiktig när du uppdaterar händelsetyper! Vissa händelsetyper har beroenden till bevarandeflöden som kan förstöras om koderna ändras.

source: Adding transfers
sv: Lägg till överföringar

source: Accession records can also include information about physical transfer of material to the archive. Transfers are sub records to an accession records which holds their own set of events. This is very useful for keeping track of acquisition that have multiple transfer sessions or from different actors. e.g. a digital registry might be transfered at one point in time by one actor (service provider), the physical records described by the registry might be located, and hence transfered by yet another actor.
sv: Leveranser kan ocksp inkludera information om fysiska överföringar till arkivet. Överföringar är en undernivå till leveranser som kan ha sina egna händelser. Detta är användbart för att hålla reda på leveranser som har flera överföringar från olika håll. T.ex. kan ett digitalt register levereras vid ett tillfälle medan de fysiska handlingarna som är registrerade kan levereras vid ett annat tillfälle men hänga ihop i en och samma leveransärende.

source: Accessions transfer tab
sv: Överföringsflik

source: To add a new accession record hit the add button and fill in the basic information, there is also optional fields for recording information about the submitter (Organization/Individual).
sv: För att lägga till en ny överföring klicka på "Lägg till knappen" och fyll i den grundläggande informationen. Det finns även en uppsättning med valfria fält som kan användas för att dokumentera information om den levererande organisationen.

source: After the creation of the transfer record, transfer specific events can be created to track the transfer process.
sv: När överföringen är skapad kan nya händelser läggas till för att spåra överföringsprocessen.

source: Transfer record overview
sv: Översikt av en överföring

source: An overview of all events both the ones that refer to the accession record it self and all transfer records, is available under the event tab
sv: En översikt av alla händelser både de som avser leveransen som helhet och de individuella överföringarna finns tillgänglig under händelsefliken

source: Event tab overview
sv: Översikt av händelseflik

source: Linking resources
sv: Länka resurser

source: The linking of materials to a specific transfer is managed through Archival descriptions and is done either by selecting multiple containers in the archival description tree and clicking the shortcut button "Link to transfer".
sv: Länkning av material i arkivredovisningen till en specifik överföring görs genom att antingen välja flera volymer (eller andra noder) i redovsiningsträdet och därefter klicka på "Koppla till överföring".

source: Transfer checkbox selection i tree
sv: Kryssruta för att välja överföring i redovisningsträdet

source: The Linking can also be done by right clicking a container in the tree and select "Link to transfer"
sv: Länkning kan också göras direkt från redovisningsträdet genom att högerklicka på en nod(volym) och välja "Lägg till i överföring"

source: Right click to select transfer
sv: Högerklicka för att välja överföring

source: Select the desired accession and transfer records and click "save"
sv: Välj den önskade leverans/accessionsposten samt överföringen och klicka på "Spara"

source: Transfer link modal
sv: Överföring länkningsformulär

source: The linked containers are now accessible from the transfer record.
sv: De länkade noderna (volymer) listas nu under den aktuella överföringen.
