Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/archival-description-management/archival-descriptions.po
Languages: sv

source: Archival Descriptions
sv: Arkivbeskrivningar/Förteckningar

source: Archival Descriptions identifies and explains the context and content of archival materials in order to promote its accessibility. ESSArch adheres to `ISAD (G), 2nd Edition <https://www.ica.org/sites/default/files/CBPS_2000_Guidelines_ISAD%28G%29_Second-edition_EN.pdf>`_ and comes with a standard set of controlled vocabularies for typed fields which can be customized or supplemented by additional values. Archival descriptions are created and controlled separately from authority records in ESSArch and are associated by linking.
sv: ESSArch stöd för arkivredovisning bygger på `ISAD (G), 2nd Edition <https://www.ica.org/sites/default/files/CBPS_2000_Guidelines_ISAD%28G %29_Second-edition_EN.pdf>`_ Arkivbeskrivningar/Förteckningar och auktoritetsposter upprättas var för sig i systemet och hålls samman genom länkning för att ge maximal flexibilitet vid beskrivning av relationer inom och mellan olika resurser och de auktoriteter som har eller haft en relation till resurserna så som arkivbildare, medskapare eller ägare.

source: Structures
sv: Strukurer

source: Structures are a basis for the arrangement, classification and description of records and can in be filing plans, business process classifications description of functions or basically any other classification system that can be represented as either a flat or a tree hierarchy structure.
sv: Strukturer utgör grunden för organisering av resurser (arkiv/samlingar). ESSArch sätter inga begränsningar till vilka strukturer som kan byggas upp och användas så länge de kan representeras som flata eller nästlade trädstrukturer.Det går alltså lika bra att upprätta en klassificeringsstruktur utifrån verksamhetsbaserad arkivredovisning som en förteckningsplan baserad på Allmänna arkivschemat så väl som strukturer anpassade för specialsamlingar.

source: Structures in ESSArch largely based upon `ISDF 1st edition <https://www.ica.org/sites/default/files/CBPS_2007_Guidelines_ISDF_First-edition_EN.pdf>`_ For a detailed crosswalk between ESSArch and ISDF please see the :ref:`ICA Standards <ICA_Standards>` section.
sv: Strukturer i ESSArch bygger på standarden `ISDF 1st edition <https://www.ica.org/sites/default/files/CBPS_2007_Guidelines_ISDF_First-edition_EN.pdf>`_ Se även :ref:`ICA Standards <ICA_Standards>` För en detaljerad beskrivning av tillämpningen av ISDF.

source: Adding new structure types
sv: Lägg till nya strukturtyper

source: New structure types are added through ESSArch's administration interface.
sv: Nya strukturtyper kan läggas till genom ESSArch's administrationsgränssnitt

source: A structure type can be configured to either allow or disallow:
sv: Det är möjligt att sätta regler för strukturer så att de aningen tillåts eller förbjuds att:

source: Editable instances of a template
sv: Redigerbara instanser av en mall

source: Editable relations (to other levels or structures) of a template
sv: Redigerbara relationer (till andra nivåer inom samma struktur eller till andra strukturer)

source: Movable instance units (nodes in a tree) of a template
sv: Flyttbara strukturenheter/noder

source: Adding new Structure Unit Types
sv: Lägg till strukturenhetsttyper

source: Structure units are the levels of classification and description within a given structure and are added to a structure type through ESSArch's administration interface.
sv: En strukturs ingående delar kallas alla för strukturenheter oavsett vilken nivå de tillhör. Benämningen strukturenhet används också oavsett vilken struktur som avses. Det vill säga att strukturenhet som begrepp används oavsett om strukturen avser verksamhetsbaserad arkivredovisning eller redovisning utifrån annat system.

source: Add structure unit type admin form
sv: Lägg till strukturenhetstyp

source: two different structure types with example structure units (levels).
sv: Nedan ett exempel på två olika strukturer med olika typer av strukturenheter

source: **Structure Type**
sv: **Strukturtyp**

source: **Structure Unit**
sv: **Strukturenhet**

source: Business Classification Scheme
sv: Klassificeringsstruktur

source: Transaction
sv: Verksamhetsområdet

source: Activity
sv: Processgrupp

source: Function
sv: Process

source: Catalogue structure
sv: Allmänna arkivschemat

source: Series
sv: Huvudavdelning

source: Sub-series
sv: Underavdelning

source: File
sv: Akt

source: Adding new Structure
sv: Lägg till en ny struktur

source: Structures (template) are administrated under the structure section of ESSArch.
sv: Strukturer (mallar) administreras under menyn strukturer

source: To add a new structure, click the new structure button .
sv: För att lägg till en ny struktur, klicka på knappen ny struktur

source: Adding Structure units
sv: Lägg till strukturenheter

source: Structure units are added to a structure by right clicking on a node in the tree.
sv: Strukturenheter läggs till genom att högerklicka på strukturen eller på en annan strukturenhet i trädet.

source: Adding relationships to other Structures / Structure units
sv: Upprätta relattioner mellan andra strukturer / strukturenheter

source: Publish
sv: Publicera

source: When a Structure has been published it becomes available for use through out ESSArch.
sv: När en struktur är publicerad blir den tillgänglig för användning för användning av andra användare i systemet (med tillämplig behörighet).

source: Top-level Resources
sv: Toppnoder

source: All resources described in ESSArch need to have a top-level resource. Intellectually this can represent the archival descriptions on the fonds or collections level.
sv: Samtliga resursers som beskrivs i ESSArch behöver ha en toppnod. En toppnod kan vara men är inte begränsat till Arkiv eller Samling

source: There are no limitations of the types of top-level resources that can be used in ESSArch. One institution might settle with just one top-level whilst another has a need for distinguish different types of archives or collections.
sv: Det finns inga begränsningar till hur många typer av toppnoder man kan använda i ESSArch. För en institution kan det vara fullt tillräckligt att bara använda en enda (Arkiv) medan andra har behov att göra åtskillnad mellan olika typer av arkiv eller samlingar.

source: Adding a new top-level resource
sv: Lägg till en ny toppnod

source: Under the resource tab click on the "new resource" button. From the structures field choose one or more structures that will act as a template for the the top-level resource it self and underlying resource descriptions defined in the structure.
sv: Under fliken Arkiv, klicka på "Nytt Arkiv"Från listan av tillgängliga strukturer väljs en eller flera strukturer som används som mall för toppnoden och de underliggande strukturenheterna som definerats för strukturen

source: When initially creating an top-level resource record the following fields are required:
sv: Vid skapandet av en en ny toppnod är följande fält obligatoriska:

source: Name (ISAD-G Title)
sv: Namn (ISAD-G Title)

source: Creator
sv: Arkivbildare

source: Type
sv: Typ

source: Reference code
sv: Referenskod

source: Adding new structure units
sv: Lägg till nya strukturenheter

source: Structure units are the levels of classification and description within a given structure. If the user has the right permissions new structure units can be added to an instance (top-level resource) of a structure.
sv: Användare med rätt behörighet kan lägga till strukturenheter till en instans (toppnod) av en struktur.

source: To add a new structure unit, right click on the tree node and select "add structure unit"
sv: För att lägga till en ny strukturenhet så högerklicka på en strukturenhet i trädet och välj "lägg till strukturenhet"

source: Adding nodes
sv: Lägga till noder

source: Nodes can be described as something with a physical representation within a logical structure, something that can be moved around. e.g. analogue information packages archival boxes, other containers as well as digital information packages (AIP) and items contained in these packages.
sv: Noder kan beskrivas som något som har en fysisk representation inom en logisk struktur. Ofta något som kan flyttas t.ex. arkivboxar eller andra förvaringsenheter såväl som digital arkivpaket (AIP) och objekt som dessa förvaringsenheter innehåller så som fotografier eller andra handlingar.

source: Nodes are added under structure units by right clicking on a structure unit in the tree and select "add node".
sv: Noder läggs till under strukturenheter genom att högerklicka på respektive strukturenhet i trädet och välj "lägg till nod".

source: When a structure unit is selected in the tree, an overview of the contents is displayed.
sv: När en strukturenhet väljs i trädet visas en översikt av dess innehåll.

source: Adding descriptive texts and notes
sv: Lägg till beskrivningar och anteckningar

source: In ESSArch one can have multiple descriptive texts / notes for resource records
sv: Det är möjligt att lägga till flera beskrivningar och anteckningar.

source: Standard type of notes that can be used in ESSArch:
sv: Fördefinerade typer:

source: Archival history
sv: Historik

source: Administrative / Biographical history
sv: Administrativ historik

source: Immediate source of acquisition or transfer
sv: Källa

source: Appraisal
sv: Värdering

source: Destruction
sv: Gallring

source: Scheduling
sv: Accessioner

source: Accruals
sv: Leveranser

source: System of arrangement
sv: Redovisningssätt

source: Physical characteristics
sv: Fysiskt skick

source: Finding aid
sv: Sökingångar

source: Publication note
sv: Allmänn anmärkning

source: Archivist's note
sv: Administrativ anmärkning

source: To add a new descriptive text click on the History or Remarks tab and then the add button.
sv: För att lägga till beskrivningar och anteckningar klicka på historik eller anmärkningaroch sedan lägg till
