Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/archival-description-management/authority-records.po
Languages: sv

source: Authority records
sv: Auktoritetsposter

source: Describes corporate bodies, persons or families that are associated with the creation and maintenance of archives, such as creator, donor or custodian.
sv: Beskriver institutioner, personer eller familjer som är associerade till skapande och förvaltning av arkiv och andra samlingar.

source: ESSArch adheres to `ISAAR (CPF), 2nd Edition <https://www.ica.org/sites/default/files/CBPS_Guidelines_ISAAR_Second-edition_EN.pdf>`_ and comes with a standard set of controlled vocabularies for typed fields which can be customized or supplemented by additional values.
sv: ESSArchs stöd för beskrivning av auktoriteter (arkivbildare, arkivägare, m.fl.) bygger på `ISAAR (CPF), 2nd Edition <https://www.ica.org/sites/default/files/CBPS_Guidelines_ISAAR_Second-edition_EN.pdf>`_

source: Authority Records are created and controlled separately from archival (resource) descriptions in ESSArch and are associated by linking.
sv: Auktoritetsposter och qrkivbeskrivningar/förteckningar upprättas var för sig i systemet och hålls samman genom länkning för att ge maximal flexibilitet vid beskrivning av relationer inom och mellan olika resurser (arkiv/samlingar/objekt) och de auktoriteter som har eller haft en relation till resurserna så som arkivbildare, medskapare eller ägare.

source: By default there is three main types of Authority records in ESSArch:
sv: Som standard finns det tre typer av auktoritetsposter i systemet och vilken som används beror på om posten avser en institution, person eller släkt.

source: These three main types can be further `subdivided <Create custom vocabularies>`_ by the organization needs or other requirements of subdivision i.e.
sv: Dessa tre huvudtyper kan sedan ges underkategorier t.ex:

source: Corporate body - State agency
sv: Corporate body - Statlig myndighet

source: Family - Royal Family
sv: Person - Alfred Nobel

source: The :ref:`ICA Standards <ICA_Standards>` section provides a detailed documentation of the entry fields of an authority record in ESSArch, their relation to ISAAR-CPF and default values available from a standard installation.
sv: :ref:`ICA Standards <ICA_Standards>` avsnittet innehåller en detaljerad beskrivning av samtliga fält som används för en auktoritetspost och hur dessa relaterar till ISAAR-CPF.

source: Creating and managing authority records
sv: Upprätta och hantera auktoritetsposter

source: Be careful when updating Authority records! Updating of an Authority record changes it for every link to the referenced record.
sv: Iaktta försiktighet vid uppdatering av auktoritetsposter! Auktoritetsposter hänger samman med andra beskrivningar i systemet genom länkning. Ändras en auktoritetspost slår ändringen igenom överallt.

source: Creating a new authority record
sv: Upprätta en ny auktoritetspost

source: A new authority record can be created by clicking the new button under the authority record section of ESSArch.
sv: En ny auktoritetspost skapas genom att klicka på knappen ny under arkivbildarfilken i ESSArch

source: When initially creating an authority record the following fields are required for all types of authority records:
sv: När en auktoritetspost läggs upp för första gången är följande fält obligatoriska:

source: Type
sv: Typ

source: Name (Authorized form)
sv: Namn (Auktoriserad namnform)

source: Language
sv: Språk

source: Reference code (institutional code)
sv: Referenskod (Arkivinstitutionskod)

source: Create date (Auto populated)
sv: Upprättad (Fylls i automatiskt)

source: New authority record form
sv: Formulär för ny auktoritetspost

source: For Authority records of type person the name field is automatically separated into Firstname and Lastname fields.
sv: För auktoritetsposter av typen person anpassas namnfältet automatiskt till för- och efternamn

source: Detail view of newly created authority record
sv: Detaljvy av en upprättad auktoritetspost

source: Adding other name forms
sv: Lägg till andra namnformer

source: By clicking the add button in the names subsection one can record additional name forms. i.e. Parallel forms of name, Standardized forms of name according to other rules and Other forms of name.
sv: Ytterligare namnformer kan läggas till i namnsektionen av en auktoritetspost t.ex. förkortningar eller tidigare namnformer

source: After the additional name form has been saved the record is available under the Names section.
sv: När namnformuläret sparats finns det tillgängligt under namnsektionen

source: Adding history, descriptive texts and notes
sv: Lägga till historik, beskrivningar och anteckningar

source: In ESSArch one can have multiple descriptive texts / notes.
sv: ESSarch erbjuder möjligheten att ha flera deskriptiva texter / anteckningar

source: Custom note types will in future EAC exports be exported as <maintenanceEvent> !
sv: Observera att egendefinerade anteckningstyper kommer exporteras som <maintenanceEvent> i en EAC-export

source: Standard type of notes that can be used in ESSArch:
sv: Standardbeskrivningar som kan användas i ESSArch

source: Biography/History
sv: Historik

source: Maintenance
sv: Allmänn anmärkning

source: Internal structures
sv: Administrativ anmärkning

source: Genealogy
sv: Biografi

source: General context
sv: Vård

source: To add a new descriptive text click on the History or Remarks tab and then the add button.
sv: För att lägga till en ny beskrivning eller anteckning klicka på filken Historik eller Anteckningar och sedan lägg till

source: From the dropdown menu choose the appropriate note type, add text and click add to save.
sv: Från dropdown-menyn väljs den typ av anteckning man vill lägga till och anteckningen sparas genom att klicka på spara.

source: Creating relations
sv: Upprätta relationer

source: Relationships with other corporate bodies, persons and families can be described by linking authority records.
sv: Relationer mellan auktoritetsposter kan upprättas genom länkning.

source: Relationship types in ESSArch are mirrored which means that if a relation is created on one authority record the relation will automatically be mirrored when viewing the referenced authority record.
sv: Relationstyper är speglade vilket innebär att om en relation upprättas på en auktoritetspost så kommer den automatiskt att speglas när man tittarr på den post som hänvisats till från den första.

source: **Type**
sv: **Typer**

source: **Mirrored Type**
sv: **Speglade typer**

source: business partner
sv: Samarbetspartner

source: successor
sv: Efterföljare

source: predecessor
sv: Föregångare

source: owned by
sv: Ägs av

source: owner of
sv: Ägare av

source: controlling
sv: Kontrollerar

source: controlled
sv: Kontrolleras av

source: subordinate
sv: Underordnad

source: superior
sv: Överordnad

source: To add a relation from one authority record to another click the add button in the related authority records section.
sv: För att upprätta relationer mellan auktoritetsposter, klicka på lägg till i sektionen för relaterade arkivbildare
