Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/archival-description-management/locations.po
Languages: sv

source: Location Records
sv: Placeringar

source: Location records can describe any storage location; buildings, rooms shelves, file cabinets, etc. Location records are designed to track both the permanent and temporary locations of materials.
sv: Placeringsposter kan beskriva vilket typ av lagringsutrymme som helst; byggnader, rum, hyllor, hyllsektioner och så vidare. Placeringsposter är utformade för att kunna hålla reda på både permanenta placering av material så väl som för temporära t.ex. då de befinner sig i en läsesal eller är under vård.

source: Location records are intended for physical spaces and not storage of digital AIP's / files. Locations for AIP's are managed via Administration/Media Information / Storage mediums
sv: Placeringsposter är avsedda att beskriva fysika utrymmen och inte digitala lagringsplatser för AIP:er eller filer. Placeringar för AIP:er hanteras via Administration/Media-Information/Lagringsmedia

source: Creating and managing location records
sv: Upprättta och hantera placeringar

source: Locations are managed in the location section of ESSArchs Archival Description Management section.
sv: Placeringar hanteras i sektionen för placeringar inom ESSArchs Arkivredovisning.

source: Locations overview
sv: Översikt av placeringsfuunktionaliteten

source: Creating a new top location record
sv: Skapa en toppnod

source: To create a new top location, click the "Add Location" button and fill in the form
sv: För att skapa en toppnod (den översta nivån i en hierarki) klicka på "Lägg till placering" och fyll i formuläret

source: Description of form fields
sv: Beskrivning av formulärfält

source: Name
sv: Namn

source: The name used for the location. Either a arbitrary string value like "Central Repository" or an identifier like 1.2.7
sv: Titeln för plaveringsposten. Kan vara ett godtyckligt strängvärde som "Centralarkivet" eller i form av en identifierare så som 1.2.7

source: Metric
sv: Måttenhet

source: The metric value used to describe capacity
sv: Måttenheten som beskriver placeringens kapacitet

source: Capacity
sv: Kapacitet

source: An Integear value of the locations total capacity
sv: En heltal som anger placeringens totala kapacitet

source: Level
sv: Nivå

source: The level (type) of location, e.g. bulding, floor, room, cabinet etc.
sv: Nivå (typ) t.ex. byggnad, våning, rum, hylla o.s.v.

source: Function
sv: Funktion

source: The locations function e.g permanent for archival storage and temporary for reading rooms
sv: Placeringens funktion t.ex. "Tillsvidare" eller "Tillfällig"

source: Adding sub locations
sv: Lägg till undernivåer

source: A top level location can have an unlimited set of nested childrens. To add a new sub location right click a node in the location tree and select "Add" and fill in the form.
sv: En toppnod kan ha ett obegränsat antal nästlade undernivåer . För att lägga ttill en ny undernivå, högerklicka på en nod i placeringstträdet och välj lägg till.

source: Add sub location
sv: Lägg till undernivå

source: Linking containers (boxes) to locations
sv: Länka volymer och andra objekt till placeringar

source: The linking of materials to a specific location is managed through a specific Archival description. You can either select multiple containers by checkboxes in the archival description tree and clicking the shortcut button "Link to location".
sv: Länkningen mellan objekt till en specifik placering hanteras genom arkivbeskrivningen/förteckningen. Det tär möjligt att antingen välja flera objekt ått gången genom att markera kryssrutorna i förteckningsträdet och klicka på knappen koppla till placering.

source: Checkbox selection i tree
sv: Kryssruta i förtteckningsträdet

source: The Linking can also be done by right clicking a container in the tree and select "Link to location"
sv: Länkning kan också göras genom att högerklicka på ettt objekt i trädet och välja "koppla till placering"

source: Right click to select location
sv: Högerklicka för att välja placering

source: In the modal form, select the desired location in the tree and hit select to save the location link
sv: I formuläret väljs den önskade placeringen i trädet och genom att klicka på spara så upprätttas placeringslänkningen

source: Location selection modal
sv: Placerings formulär

source: The linked location is now visible from the containers detail view. The locations detail view shows all containers registred.
sv: Den länkade placeringen är nu synlig från objektets detaljvy. Placeringens detaljvy visar alla objekt som registrerats.

source: Location detail view
sv: Placeringens detaljvy

source: Moving containers to a new location
sv: Flytta volymer och andra objekt till en ny placering

source: Containers can be moved between locations by selecting the containers in the table of the locations detail view and hitting the "Link to new location" button. By holding down shift button while clicking enables you to select multiple containers to be moved.
sv: Volymer och andra objekt kan flytttas mellan placeringar genom att välja objeken i placeringens detaljvy och därefter klicka på "Koppla till ny placering". Genom att hålla nera shiftttangenten samtidigt som man klickar möjliggör att markera flera objekt.

source: Managing vocabularies
sv: Hantera vokabulär

source: The vocabularies used for location levels, functions and metric types can be managed through ESSArchs Administration interface.
sv: Vokabulären som används för placeringars nivåer, funkioner och måttenheter kan hanteras genom ESSArchs administtrattionsgränssnit.

source: Add location type
sv: Lägg till placeringstyp
