Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/tags/locale/*/LC_MESSAGES/django.po
Languages: sv

source: Archival Description
sv: Arkivredovisning

source: name
sv: namn

source: node identifier type
sv: nodidentifieringstyp

source: node identifier types
sv: nodidentifieringstyper

source: node note type
sv: nodanmärkningstyp

source: node note types
sv: nodanmärkningstyper

source: mirrored type
sv: motsatt typ

source: node relation type
sv: nodrelationstyp

source: node relation types
sv: nodrelationstyper

source: instance name
sv: instansnamn

source: editable instances
sv: redigeringsbara instanser

source: editable instance relations
sv: redigeringsbara instansrelationer

source: movable instance units
sv: flyttbara instansenheter

source: structure type
sv: strukturtyp

source: structure types
sv: strukturtyper

source: structure relation type
sv: strukturrelationstyp

source: structure relation types
sv: strukturrelationstyper

source: description
sv: beskrivning

source: start date
sv: startdatum

source: end date
sv: slutdatum

source: template
sv: mall

source: is editable
sv: är redigerbar

source: is template
sv: är mall

source: published
sv: publicerad

source: Date render format
sv: Datumformat

source: structure unit type
sv: strukturenhetstyp

source: structure unit types
sv: strukturenhetstyper

source: transfers
sv: överföringar

source: Can add structure unit instances
sv: Kan skapa instanser av strukturenheter

source: Can change instances of structure units
sv: Kan ändra instanser av strukturenheter

source: Can delete instances of structure units
sv: Kan radera instanser av strukturenheter

source: Can move instances of structure units
sv: Kan flytta instanser av strukturenheter

source: metric type
sv: enhetstyp

source: metric types
sv: enhetstyper

source: location level type
sv: placeringsnivå

source: location level types
sv: placeringsnivåer

source: location function type
sv: placeringsfunktion

source: location function types
sv: placeringsfunktioner

source: metric
sv: enhet

source: capacity
sv: kapacitet

source: level type
sv: nivå

source: function
sv: funktion

source: location
sv: placering

source: locations
sv: placeringar

source: archive type
sv: arkivtyp

source: node type
sv: nodtyp

source: node types
sv: nodtyper

source: Type
sv: Typ

source: delivery type
sv: leveranstyp

source: delivery types
sv: leveranstyper

source: Published structures cannot be changed
sv: Publicerade strukturer kan ej ändras

source: {} cannot be changed
sv: {} kan ej ändras

source: Cannot add relations to structure instances
sv: Relationer kan ej skapas för strukturinstanser

source: Units in instances cannot relate to units in another archive
sv: Enheter i instanser kan inte relateras till enheter i andra arkiv

source: Unit relations in instances of type {} cannot be edited
sv: Enhetsrelationer i instanser av typen {} kan inte redigeras

source: Cannot create units in instances of type {}
sv: Kan ej skapa enheter i instanser av typen {}

source: Units in instances of type {} cannot be moved
sv: Enheter i instanser av typen {} kan inte flyttas

source: Units in instances of type {} cannot be edited
sv: Enheter i instanser av typen {} kan inte redigeras

source: Unit type {} is not allowed in structure type {}
sv: Enhetstypen {} är inte tillåten i strukturtypen {}

source: Archive already added
sv: Arkivet har redan lagts till

source: FINDING AID
sv: ARKIVFÖRTECKNING

source: Resource reference code
sv: Referenskod Arkiv

source: Creators
sv: Arkivbildare

source: Print Date
sv: Utskriftsdatum

source: Table of content
sv: Innehåll

source: container
sv: volym

source: containers
sv: volymer

source: History
sv: Historik

source: Created
sv: Skapad

source: Revised
sv: Ändrad

source: Notes
sv: Anmärkningar

source: Reference Code
sv: Seriesignum

source: Location
sv: Placering

source: Ref.code
sv: Vol.nr

source: Time
sv: Tid

source: Search results
sv: Sökresultat

source: User
sv: Användare

source: Date
sv: Datum

source: Archive
sv: Arkiv

source: Reference code
sv: Referenskod

source: Title
sv: Titel

source: Description
sv: Beskrivning

source: Location must be empty before deletion
sv: Placeringen måste vara tom innan den kan tas bort

source: Can only publish templates
sv: Endast mallar kan publiceras

source: {} is already published
sv: {} är redan publicerad

source: {} is not published
sv: {} är inte publicerad

source: No version name provided
sv: Inget versionsnamn har angivits

source: Version {} already exists
sv: Version {} existerar redan

source: Cannot delete units in instances of type {}
sv: Kan ej radera enheter i instanser av typen {}
