Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/docs/locale/*/LC_MESSAGES/user_guide/user-interface.po
Languages: sv

source: Interface
sv: Gränssnitt

source: List view
sv: Listvy

source: The list view is the table of objects that is present in most views in ESSArch. The objects listed in this view are always relevant to the current view, and filtered depending on state and permissions and provided are additional optional filter and sorting options.
sv: Listvyn är tabellen med objekt som existerar i de flesta vyer i ESSArch. Innehållet är alltid relevant för den nuvarande vyn och är filtrerat efter tillståndet på innehållet samt användarens rättigheter. Tillgängligt är även ytterliggare frivilliga filter och sorteringsalternativ.

source: The list view can be filtered by clicking the filter icon, which opens a menu with all available filters.
sv: Listvyn kan filtreras genom att klicka på filterikonen, som öppnar en meny med alla tillgängliga filter.

source: In ESSArch Preservation Platform (EPP) many list views includes nested IPs which can be expanded to see the underlying IPs. What should appear in the first level can be administrated in the :ref:`user settings <user-settings-ip-view-type>`.
sv: I ESSArch Preservation Platform (EPP) inkluderar många av listvyerna nästlade IPn som kan bli expanderade för att se underliggande IPn. Vad som ska visas på den första nivån kan administreras i :ref:`användarinställningarna <user-settings-ip-view-type>`.

source: The main functionality of a view, such as preparation, creation and preservation, is accessed by clicking on a row in the IP list.
sv: Huvudfunktionaliteten i en vy, t.ex. förberedelse, skapande och arkivering, används genom att klicka på en rad i listan med IPn.

source: State view
sv: Tillståndsvy

source: Clicking the **State** column will show all steps and tasks for an IP. This view has information about the progress and/or outcome of each step and task.
sv: För att se alla steg och jobb för ett IP så klickar man i kolumnen **Tillstånd**. I vyn som öppnas så visas information om tillstånd och resultat från steg och jobb som har utförts, utförs just nu eller som ska utföras.

source: Click on a step or a task to see more information. This is very useful if an error occurs because the user can access a detailed description of the error which will help when finding out where things went wrong.
sv: Klickar man på ett steg eller jobb så visas mer detaljerad information som framförallt är användbar om något går fel för att kunna undersöka vart det gick fel, samt hur man går vidare för att lösa det.

source: Events view
sv: Eventvy

source: Clicking the **Event**-column will show a list of all events for an IP. A user can add new events by filling out the fields and clicking **Add event**.
sv: Klickar man i **Event**-column så visas en lista med alla händelser för ett IP. En användare kan själv lägga till en manuell händelse genom att fylla i fälten och klicka på **Lägg till event**

source: Delete IP
sv: Radera IP

source: A user with enough permissions can delete an IP by clicking the **delete**-button.
sv: En användare med tillräckliga behörigheter kan radera ett IP genom att klicka på knappen i **Radera**-kolumnen

source: User settings
sv: Användarinställningar

source: User settings can be found by clicking the user symbol in the top right corner and selecting "User settings".
sv: Använarinställningar visas genom att klicka på användarsymbolen i det övre högra hörnet och sen välja "Användarinställningar".

source: Column picker
sv: Tabellkolumner

source: The user can choose which columns should be shown in all the IP list views of ESSArch and in which order they appear.
sv: Användaren kan välja vilka kolumner samt dess ordning som ska visas i IP-listorna

source: IP view type
sv: IP visualisering

source: In ESSArch Preservation Platform (EPP) there is an additinal setting - **IP view type** that allows the user to choose what to see in the IP list view.
sv: I ESSArch Preservation Platform (EPP) finns det en extra inställning - **IP-visualisering** som tillåter användaren att välja hur IP-listorna presenteras.

source: IP - The first generation of each AIC with all other generations nested
sv: IP - Den första generationen av varje AIC med alla andra generationer nästlade

source: AIC - The AIC with all generations nested
sv: AIC - AIC:n med alla generationer nästlade
