Repository: ESSolutions/ESSArch
Catalog: ESSArch_Core/ip/locale/*/LC_MESSAGES/django.po
Languages: sv

source: Clear lock for selected ip
sv: Rensa lås för markerade informationspaket

source: Information Package
sv: Informationspaket

source: Archivist Organization
sv: Arkivorganisation

source: Excluded Package Type
sv: Exkluderad pakettyp

source: Workarea
sv: Arbetsyta

source: object_identifier_value
sv: Objekt id

source: create date
sv: skapandedatum

source: state
sv: tillstånd

source: object size
sv: objektstorlek

source: start date
sv: startdatum

source: end date
sv: slutdatum

source: entry date
sv: skapandedatum (SIP)

source: package type
sv: pakettyp

source: cached
sv: cachad

source: archived
sv: arkiverad

source: responsible
sv: ansvarig

source: information package
sv: informationspaket

source: information packages
sv: informationspaket

source: transfer
sv: överföring

source: delivery
sv: leverans

source: name
sv: namn

source: order type
sv: beställningstyp

source: order types
sv: beställningstyper

source: consign method
sv: utlämnandemetod

source: consign methods
sv: utlämnandemetoder

source: type
sv: typ

source: {backend} job done for {ip}
sv: {backend} jobb är klart för {ip}

source: {ip} has been deleted
sv: {ip} har tagits bort

source: {ip} is now in workspace
sv: {ip} är nu i arbetsytan

source: Receiving {ip}
sv: Tar emot {ip}...

source: Preserved {{OBJID}}
sv: Bevarad {{OBJID}}

source: {{OBJLABEL}} ({{OBJID}}) is now preserved
sv: {{OBJLABEL}} ({{OBJID}}) är nu bevarad

source: {ip} is now preserved
sv: {ip} är nu bevarad

source: Preserving {ip}...
sv: Bevarar {ip}...

source: New generation created {ip}
sv: Ny generation skapad {ip}

source: Accessing {ip}...
sv: Hämtar {ip}...

source: Upload of {filepath} complete
sv: Lyckad uppladdning av {filepath}
